{
  "backend/main.mo": "Defines actor backend with authorization, storage, Stripe integration, and domain types for teams, players, sponsors, and comparisons.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, pages, and hooks.",
  "frontend/index.css": "Tailwind base/theme variables and dark mode definitions for global styling.",
  "frontend/index.html": "Root HTML page loading fonts, metadata, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, React Query, theming, and imports all main pages including admin sections.",
  "frontend/src/capacitor-config.ts": "Empty placeholder file for Capacitor configuration.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "UI screen informing unauthorized users with return-home button.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard controlling admin access with redirects and loading states.",
  "frontend/src/components/CountdownTimer.tsx": "React countdown timer computing remaining time and rendering styled time units updated every second.",
  "frontend/src/components/Footer.tsx": "Footer component displaying about info, navigation links, contact details, and a disclaimer with a scroll-to-top handler.",
  "frontend/src/components/Header.tsx": "Header with logo, navigation links, admin links, authentication-aware UI, and a responsive mobile menu.",
  "frontend/src/components/Layout.tsx": "Layout wrapper rendering header, footer, WhatsApp button, and auto-scrolling to top on route changes.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with status indicators and toast messages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and submitting user profile details with validation and save mutation.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button opening a prefilled message thread.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on identity, with query invalidation on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling AuthClient creation, login state, and identity persistence. Exposes a hook to access identity, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including user profile, admin checks, authentication-aware queries, and mutations. Integrates identity and actor state to control query behavior.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, typography, and light/dark color palettes for the application. Applies base styling for layout, text, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and InternetIdentityProvider. Loads global CSS and renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders a styled About page describing the vision, mission, and features of the Bihar Cricket Mahotsav. Uses cards, icons, and gradient sections to display informational content.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard displaying registration, payment, and sponsor stats with loading skeletons. Uses route guards, React Query data, and UI components to show administrative metrics.",
  "frontend/src/pages/AdminLoginPage.tsx": "Handles admin authentication via Internet Identity, redirects admins, and manages bootstrap and principal-ID actions.",
  "frontend/src/pages/AdminPlayersPage.tsx": "Fetches and manages player registrations with search, payment toggling, and CSV export features.",
  "frontend/src/pages/AdminSponsorsPage.tsx": "Displays sponsor inquiries, supports status updates and deletion, and shows summary stats.",
  "frontend/src/pages/AdminTeamsPage.tsx": "Lists team details with logos and purse info, with loading skeletons and read-only management.",
  "frontend/src/pages/AuctionTeamsPage.tsx": "Shows auction rules and participating teams with logos and descriptive UI sections.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact methods including location, email, WhatsApp, and quick info sections.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero section, key tournament highlights, team logos, and CTA navigation for registration and info pages.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the full tournament flow using step-by-step cards with images, covering registration through the grand final.",
  "frontend/src/pages/PaymentCancelPage.tsx": "Displays a cancelled payment message with help info and buttons to retry registration or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies payment via query params and shows payment details, confirmation, and next steps after successful registration.",
  "frontend/src/pages/PlayerRegistrationPage.tsx": "Provides a validated multi-field player registration form with prefill, submission handling, and eligibility checks.",
  "frontend/src/pages/PrizesPage.tsx": "Shows prize pool details with cards and images for winners, runner-up, man of the series, and participation rewards.",
  "frontend/src/pages/SponsorshipPage.tsx": "Renders a sponsorship inquiry form with validation, submission via hook, and displays sponsorship tiers and benefits.",
  "frontend/src/pages/TeamsDetailPage.tsx": "Fetches and displays official teams with logos, descriptions, and a responsive grid layout.",
  "frontend/src/polyfills/processEnv.ts": "Polyfills process.env at runtime and sets II_URL from meta env or a default fallback.",
  "frontend/src/utils/clipboard.ts": "Provides a clipboard copy utility with modern API support and mobile-friendly fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, typography, colors, layout settings, and plugins.",
  "project_state.json": "Describes project state, issues, architectural notes, and feature requirements for the site."
}