{
  "backend/main.mo": "Defines actor with authorization, storage, and Stripe mixins plus types and comparators for teams, players, sponsors, and related domain models.",
  "feature_evidence.json": "Lists feature evidence reports linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global styles.",
  "frontend/index.html": "Base HTML entrypoint loading fonts, metadata, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, initializes query client, and sets up the main application component with theming and toasts.",
  "frontend/src/capacitor-config.ts": "Empty Capacitor configuration file placeholder.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Access denied UI for unauthorized users with option to return home.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that checks authentication and admin status, showing loaders or access-denied screen as needed.",
  "frontend/src/components/CountdownTimer.tsx": "React countdown timer component computing remaining time and rendering responsive time blocks updated every second.",
  "frontend/src/components/Footer.tsx": "Footer component with organization info, quick links, contact details, disclaimer, and scroll-to-top link behavior.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, admin links, and login status handling.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper adding header, footer, WhatsApp button, and scroll-to-top on route change.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with toast notifications and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form allowing users to submit basic profile info and save it via mutation.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating button that opens a WhatsApp chat with a preset message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider managing authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, roles, admin checks, and identity-based queries tied to a backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, typography, and global styles.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the public About page with vision, mission, and tournament feature sections using styled cards and icons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays admin stats such as registrations, payments, and inquiries with protected access via an admin route guard.",
  "frontend/src/pages/AdminLoginPage.tsx": "Handles admin authentication using Internet Identity, admin role checks, and initial admin role assignment UI.",
  "frontend/src/pages/AdminPlayersPage.tsx": "Admin interface for viewing, searching, exporting, and updating payment status of player registrations. Combines authenticated and anonymous registrations into a unified table with CSV export.",
  "frontend/src/pages/AdminSponsorsPage.tsx": "Admin page for managing sponsor inquiries, allowing status updates, deletion, and viewing counts by status. Displays inquiries in a table with status badges and actions.",
  "frontend/src/pages/AdminTeamsPage.tsx": "Admin view showing all teams with logos and details like purse and owner. Provides a read-only team grid with loading skeletons and future editing placeholder.",
  "frontend/src/pages/AuctionTeamsPage.tsx": "Public page outlining auction rules and displaying participating teams with their logos. Includes a featured auction image and descriptive sections.",
  "frontend/src/pages/ContactPage.tsx": "Contact page presenting location, email, WhatsApp links, and guidance for queries. Includes a quick-contact section for players, sponsors, and team owners.",
  "frontend/src/pages/HomePage.tsx": "Homepage showcasing the tournament’s highlights, team logos, registration info, and hero section. Uses dynamic data like registration counts and team list while promoting key navigation paths.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays a step‑by‑step explanation of the tournament process with images and descriptions. Alternates layout per step using a mapped steps array.",
  "frontend/src/pages/PaymentCancelPage.tsx": "Shows a payment cancellation message with help info and navigation buttons. Provides contact details and options to retry registration or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Validates and displays payment success details after registration. Handles loading, error states, and shows payment metadata and next steps.",
  "frontend/src/pages/PlayerRegistrationPage.tsx": "Implements a detailed player registration form with validation, prefilled user data, and submission flow. Handles various player fields, errors, and conditional form display.",
  "frontend/src/pages/PrizesPage.tsx": "Renders prize information cards and images for the tournament. Includes prize pool details and visual prize showcases.",
  "frontend/src/pages/SponsorshipPage.tsx": "Provides sponsorship tiers, benefits, and an inquiry form with validation and submission handling. Requires authentication to submit sponsorship inquiries.",
  "frontend/src/pages/TeamsDetailPage.tsx": "React page displaying official teams with logos, descriptions, loading state, and a grid layout using useGetTeams.",
  "frontend/src/polyfills/processEnv.ts": "Polyfills process.env at runtime and sets II_URL from import.meta.env or a default fallback.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, fonts, animations, and container settings for the frontend.",
  "project_state.json": "Project state file describing current features, issues, and admin login problems for the Bihar Cricket Mahotsav site."
}