{
  "kind": "build_request",
  "title": "Fix admin access flow and first-admin bootstrap detection",
  "projectName": "Bihar Cricket Mahotsav",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Fix the first-admin bootstrap detection so the UI only offers “Become the First Admin” when the backend confirms that zero admin principals exist (do not infer this state from the caller’s role being `guest`).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "fix it"
        ]
      },
      "acceptanceCriteria": [
        "When at least one admin already exists, `/admin/login` does not show the “Become the First Admin” call-to-action to non-admin users.",
        "When there are zero admins configured, an authenticated user visiting `/admin/login` sees the “Become the First Admin” call-to-action.",
        "The backend exposes a query method that reliably indicates whether any admins exist (or returns an admin count), and the frontend uses it to drive the bootstrap UI state."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Ensure the Access Denied experience for authenticated non-admin users provides a clear admin setup/troubleshooting path by always showing the authenticated user’s Principal ID (retrieved via the backend method `getCallerIdAsText()`), along with copy-to-clipboard and retry behaviors that work on mobile browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "fix it"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated non-admin user is denied admin access, the screen shows “Your Principal ID” and displays the value returned by `getCallerIdAsText()`.",
        "If Principal ID retrieval fails, the UI shows an error state and a retry button that re-runs the Principal ID query.",
        "A copy button copies the Principal ID to the clipboard when available; if clipboard access fails, the user sees an error toast/message.",
        "No code path attempts to read Principal ID from `window.ic` for this screen."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Adjust admin route behavior so an authenticated non-admin user attempting to open admin pages (e.g., `/admin`, `/admin/players`, `/admin/sponsors`, `/admin/teams`) is directed to the dedicated troubleshooting/admin-login experience (instead of being stuck on a dead-end denial screen), without creating redirect loops.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "fix it"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users who open any admin route are redirected to `/admin/login`.",
        "Authenticated admins can access admin routes normally.",
        "Authenticated non-admin users who open any admin route are routed to an admin-access troubleshooting experience (e.g., `/admin/login` or an equivalent screen) and are not trapped in redirect loops.",
        "The routed troubleshooting experience continues to display Principal ID and sign-out options as shown in the uploaded screenshot context (Access Denied + Principal ID + Sign Out/Go to Home)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files in `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui` (compose instead)."
  ],
  "nonGoals": [
    "Homepage redesign/typography/motion changes not directly required to fix the admin access issue.",
    "Adding third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}