{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin access flow and first-admin bootstrap detection (frontend-only)",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Drive “Become the First Admin” visibility from backend bootstrap status (not inferred from guest role).",
      "acceptanceCriteria": [
        "When at least one admin already exists, `/admin/login` does not show the “Become the First Admin” call-to-action to non-admin users.",
        "When there are zero admins configured, an authenticated user visiting `/admin/login` sees the “Become the First Admin” call-to-action.",
        "The backend exposes a query method that reliably indicates whether any admins exist (or returns an admin count), and the frontend uses it to drive the bootstrap UI state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook that calls the backend capability `isSystemBootstrapNeeded()` and exposes its boolean result to the UI; ensure it is safe to use with actor readiness and authentication state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Replace the current `noAdminsExist` detection (based on `UserRole.guest`) with the new bootstrap-needed query result, and show “Become the First Admin” only when authenticated and the backend confirms bootstrap is needed. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Improve the authenticated non-admin troubleshooting screen to always show backend-fetched Principal ID with robust copy and retry (mobile-friendly).",
      "acceptanceCriteria": [
        "When an authenticated non-admin user is denied admin access, the screen shows “Your Principal ID” and displays the value returned by `getCallerIdAsText()`.",
        "If Principal ID retrieval fails, the UI shows an error state and a retry button that re-runs the Principal ID query.",
        "A copy button copies the Principal ID to the clipboard when available; if clipboard access fails, the user sees an error toast/message.",
        "No code path attempts to read Principal ID from `window.ic` for this screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clipboard.ts",
          "operation": "create",
          "description": "Create a small clipboard helper that attempts `navigator.clipboard.writeText` first and falls back to a mobile-compatible method (e.g., temporary textarea + selection) with a clear success/failure signal for toast messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "In the authenticated non-admin Access Denied/troubleshooting view, always render a “Your Principal ID” section driven solely by `getCallerIdAsText()` (no `window.ic`), add an explicit retry button on failure that re-runs the query, and switch copy behavior to the shared clipboard helper with failure toasts/messages. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Route authenticated non-admin users from admin pages to the troubleshooting/admin-login experience without redirect loops.",
      "acceptanceCriteria": [
        "Unauthenticated users who open any admin route are redirected to `/admin/login`.",
        "Authenticated admins can access admin routes normally.",
        "Authenticated non-admin users who open any admin route are routed to an admin-access troubleshooting experience (e.g., `/admin/login` or an equivalent screen) and are not trapped in redirect loops.",
        "The routed troubleshooting experience continues to display Principal ID and sign-out options as shown in the uploaded screenshot context (Access Denied + Principal ID + Sign Out/Go to Home)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Change the authenticated non-admin behavior from rendering the dead-end `AccessDeniedScreen` to navigating to `/admin/login` (optionally preserving the attempted path via router state/search) while preventing redirect loops; keep unauthenticated redirects to `/admin/login` and allow authenticated admins through. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}